
**********************************************************************
      * File Name       : CDMMF001P (PF)
      * Author          : Subu
      * Date            : 02/11/2024
      * Description     : Multi Member Flat File
**********************************************************************

     A          R CDMMF001P
     A            FLDMMF1      200A         TEXT('FIELD 1')

