             PGM        PARM(&ERRORID &PGMQ)
             DCL        VAR(&ERRORID) TYPE(*CHAR) LEN(8)
             DCL        VAR(&PGMQ) TYPE(*CHAR) LEN(8)
             IF         COND(&PGMQ *EQ ' ') THEN(CHGVAR VAR(&PGMQ) +
                          VALUE('*'))
             SNDPGMMSG  MSGID(&ERRORID) MSGF(*LIBL/CDMSGF01) +
                          TOPGMQ(*SAME (&PGMQ))
             ENDPGM
